{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "name": "data", "input_dtype": "float32"}, "inbound_nodes": [], "name": "data"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "fc_1", "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 20}, "inbound_nodes": [[["data", 0, 0]]], "name": "fc_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "fc_2", "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 20}, "inbound_nodes": [[["fc_1", 0, 0]]], "name": "fc_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "output", "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 2}, "inbound_nodes": [[["fc_2", 0, 0]]], "name": "output"}], "input_layers": [["data", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model_1"}}